[
  {
    "title": "L'énumération sur un système Linux pour l'Attaque / Défense",
    "start": "2024-10-24T16:00:00",
    "duration": 1,
    "location": "ESGI Paris",
    "speaker": "Admin 3e année",
    "description": "Trouver et exploiter des éléments pour une évélation de privilèges</br>Limiter les vecteurs d'attaque de notre système",
    "url": ""
  },
  {
    "title": "Présentation Basic exploitation AD",
    "start": "2024-12-19T16:00:00",
    "duration": 1,
    "location": "ESGI Paris, A07",
    "speaker": "Bonziski, Spoon, Azox, lululufr",
    "description": "Au programme:</br>- Présentation des concepts principaux</br>- Exemple d'exploitation kerberos</br>  - Kerberoasting</br>  - AS rep roasting</br>  - Golden ticket</br>- Exemple de privesc AD</br>  - Unquoted service Path</br>  - Insecure service Permissions</br></br>Accesssible pour tous les niveaux.",
    "url": ""
  },
  {
    "title": "L'aléatoire au cœur de la sécurité informatique",
    "start": "2025-01-23T15:45:00",
    "duration": 1,
    "location": "ESGI Paris",
    "speaker": "balkouille, SKIP, Hiruko",
    "description": "Nous avons le plaisir de vous inviter à une conférence passionnante sur le thème : 'L'aléatoire au cœur de la sécurité informatique', qui se tiendra ce jeudi 23 Janvier 2025.</br></br>Un mauvais aléatoire peut compromettre vos systèmes les plus sécurisés. Venez découvrir pourquoi l'entropie est essentielle en cryptographie, les erreurs à éviter et les meilleures pratiques pour renforcer la sécurité de vos données.</br>Au programme :</br>- Différence entre hasard 'vrai' et pseudo-aléatoire.</br>- Rôle et utilisation de l'entropie dans nos systèmes modernes.</br>- Bonnes pratiques et outils pour auditer et améliorer l'aléatoire de vos systèmes.",
    "url": ""
  },
  {
    "title": "RETEX post-études",
    "start": "2025-02-13T19:00:00",
    "duration": 2,
    "location": "ESGI Paris, A07",
    "speaker": "Baptiste Demarche, Antoine Fevre, Joakim Pettersen, Léo Pérochon",
    "description": "💡 Au programme :</br>- Leur retour d’expérience sur la recherche d’emploi 💼</br>- Leur parcours professionnel 🚀</br>- Leurs projets futurs 🔮</br>- Une session de questions/réponses 🎤",
    "url": ""
  },
  {
    "title": "Présentation de Exegol",
    "start": "2025-02-24T19:00:00",
    "duration": 2,
    "location": "ESGI Paris",
    "speaker": "Charlie Bromberg aka Shutdown",
    "description": "💡 Au programme :</br>- Présentation du projet Exegol</br>- Prise en main et pratique</br>- AMA (Ask Me Anything)",
    "url": ""
  },
  {
    "title": "La présentation d’un tiering model adaptatif",
    "start": "2025-03-19T19:00:00",
    "duration": 1,
    "location": "ESGI Paris, A07",
    "speaker": "NZR, Bageto",
    "description": "Vous avez de bonnes bases en systèmes et réseaux ? Vous avez suivi la conférence précédente ou vous avez de bonnes connaissances en Active Directory ? Alors cette conférence est faite pour vous !",
    "url": ""
  },
  {
    "title": "Hacking IoT: Du reverse de firmware jusqu'aux attaques sans fils",
    "start": "2025-03-27T20:30:00",
    "duration": 1,
    "location": "Discord HackLab ESGI",
    "speaker": "HSbF6",
    "description": "Ils sont tout autour de nous, ils ont une importance cruciale dans notre vie et pourtant… Sont-ils réellement sécurisés ? Comment les objets connectés que vous jetez peuvent trahir vos secrets ? Pourquoi l'alarme de votre domicile ne vous protège (peut-être) pas ?</br></br>Pendant 1h, découvrez les secrets de la sécurité des loT !",
    "url": ""
  },
  {
    "title": "Rootkit noyau en langage Rust",
    "start": "2025-04-07T19:00:00",
    "duration": 1,
    "location": "ESGI Paris, A07",
    "speaker": "Rafik Frarma, Jules Leveillard, Antoine C., Mathis L.",
    "description": "À travers cette présentation, vous apprendrez ce qu'est un rootkit et saurez reconnaître ses différents types se promenant sur le darkweb. Nous vous détaillerons des techniques et autres fourberies permettant à un rootkit d'être indétectable par le système. Nous verrons également les nombreuses contre-mesures plus ou moins efficaces et dresserons un portrait de célèbres rootkit. Par-dessus tout, nous vous proposons une approche programmatique pour créer son propre rootkit en langage Rust. Sortez votre costume de ninja, car nous allons nous camoufler dans les méandres du système Windows ; préparez-vous à en tromper ses gardiens.",
    "url": ""
  },
  {
    "title": "Explication des CTF",
    "start": "2025-04-11T21:00:00",
    "duration": 1,
    "location": "Discord HackLab ESGI",
    "speaker": "lululufr, Gelven",
    "description": "🧠 C’est quoi un CTF (Capture The Flag) ?</br>🔍 Comment fonctionne une team CTF ?</br>💻 Pourquoi s’y investir quand on fait de la cybersécurité ?</br></br>Nous vous expliquerons tout ce vendredi lors d’une session ouverte à toutes et tous.</br></br>Un bon moyen de découvrir un univers aussi formateur que stimulant 👾",
    "url": ""
  },
  {
    "title": "Détecter les images manipulées par IA : objectif réaliste ou mission impossible ? ",
    "start": "2025-04-28T19:00:00",
    "duration": 1,
    "location": "ESGI Paris, A07",
    "speaker": "Rony Abecidan",
    "description": "👀 Aujourd’hui, n’importe qui peut générer une fausse image bluffante avec une IA.</br>Sur les réseaux, dans la pub, voire dans des contextes sensibles... les dérives sont déjà là.</br>Mais est-ce qu’on peut encore les repérer ?</br>Les outils actuels sont-ils vraiment efficaces… ou à côté de la plaque ? 🤖🔍</br></br>👉 Rony Abecidan viendra nous expliquer les vraies limites des détecteurs actuels, pourquoi c’est un enjeu critique en cybersécurité, et ce qu’il reste à inventer pour ne pas se faire berner.",
    "url": ""
  },
  {
    "title": "GEOINT - Analyse d'une frappe en ukraine",
    "start": "2025-05-15T15:45:00",
    "duration": 1,
    "location": "ESGI Paris",
    "speaker": "Mehdy Abadi",
    "description": "Cette présentation retrace l’analyse géospatiale et informationnelle d'une attaque sur la ville de Soumy. En croisant des images satellites, des vidéos open source, elle identifie les points d’impact, la zone de lancement probable et les cibles visées.</br></br>Disclaimer : cette présentation n’est pas à but politique, de plus certaines vidéos et photo de guerre pourraient être diffusées, si cela vous perturbe merci de ne pas venir.",
    "url": "https://www.meetup.com/hacklab_esgi/events/307657655/"
  },
  {
    "title": "Hackadémie - Analyse forensique Windows ",
    "start": "2025-10-09T16:00:00",
    "duration": 3,
    "location": "ESGI Paris, A06",
    "speaker": "Tom Baty",
    "description": "Dans cette première session de Hackadémie, nous vous présenterons l’analyse forensique sur un système Windows, avant de passer à une mise en pratique sur un Sherlock HTB.</br>Séance ouverte à tous, sans prérequis de niveau.</br>⚠️ Une installation Windows (VM ou boot) sera toutefois nécessaire pour participer.",
    "url": ""
  },
  {
    "title": "Hackadémie - Session libre cybersécurité",
    "start": "2025-10-16T16:00:00",
    "duration": 2,
    "location": "ESGI Paris, B12",
    "speaker": "Yanis Bouseksou",
    "description": "Venez comme vous êtes !</br>Cette session est ouverte à tous les niveaux, et vous pourrez y travailler sur le sujet de votre choix, en solo ou en groupe.</br>Des membres du HackLab seront présents pour vous accompagner et répondre à vos questions.",
    "url": ""
  },
  {
    "title": "Hackadémie - Session libre cybersécurité",
    "start": "2025-10-23T15:45:00",
    "duration": 2,
    "location": "ESGI Paris, B01",
    "speaker": "Damien Vaurette",
    "description": "Venez échanger et discuter des sujets qui vous passionnent !",
    "url": ""
  },
  {
    "title": "Hackadémie - Analyse forensique à travers la Win32 API",
    "start": "2025-11-06T16:00:00",
    "duration": 2,
    "location": "ESGI Paris, A06",
    "speaker": "Tom Baty",
    "description": "Au programme ~20 min de près ainsi qu’une mise en pratique sur un Sherlock HTB !</br></br>PRÉ-REQUIS</br>🛠️  IDA (free) et API Monitor</br>‼️Session ouverte à tous, pas de niveau pré requis. Le but étant de s’amuser et de travailler ensemble en mêlant les manières de faire et de réfléchir de chacun !",
    "url": ""
  },
  {
    "title": "Hackadémie - Les concepts clés d'Active Directory !",
    "start": "2025-11-12T18:00:00",
    "duration": 2,
    "location": "Discord du HackLab ESGI",
    "speaker": "Enzo Breillou",
    "description": "Cette session vise à reprendre toutes les bases qui seront nécessaires pour une future session animée par @Azox sur du pentest Active Directory.",
    "url": ""
  },
  {
    "title": "Session libre HTB",
    "start": "2025-11-20T14:45:00.000Z",
    "duration": 1,
    "location": "Nation 1 (coming soon)",
    "speaker": "@srv_yagoo",
    "description": "Session libre autour de HackTheBox, venez testez des challenges et progresser tous ensemble !",
    "url": ""
  },
  {
    "title": "Introduction au forensic +  Pratique via un challenge ou Sherlock HTB",
    "start": "2025-11-27T14:45:00.000Z",
    "duration": 1,
    "location": "Nation 1 - B12",
    "speaker": "@54ph1r, @dvm_khpte",
    "description": "Présentation du domaine, ses usages, méthodes & outils puis possibilité de pratiquer soit avec un challenge HTB soit un sherlock (retired)",
    "url": ""
  },
  {
    "title": "Préparation soutenance / Session libre HTB",
    "start": "2025-12-04T15:00:00.000Z",
    "duration": 1,
    "location": "Nation 1 - B12",
    "speaker": "@lululufr",
    "description": "Afin de préparer les soutenances 5ème année Blue Team et Audit Web ce vendredi nous vous proposons de venir présenter vos sujets. Un entraînement qui ne peut qu'être utile ! Si d'autres promo ont également des soutenances de prévue bientôt, libre à vous de venir qu'importe le sujet. Nous continuerons ensuite avec une session libre HTB/Aide aux devoirs.",
    "url": ""
  },
  {
    "title": "Construire, automatiser et comprendre : Les nouvelles mécaniques de la Cyber Threat Intelligence",
    "start": "2025-12-11T18:00:00.000Z",
    "duration": 1,
    "location": "Nation 1 (coming soon) + <#1407718623509872732>",
    "speaker": "@adrien6459",
    "description": "Cette conférence présente les fondamentaux de la Cyber Threat Intelligence, à travers ses notions clés et un cas pratique. De quoi comprendre le fonctionnement et les enjeux de ce domaine. Vous pourrez également poser toutes vos questions, sur le secteur ou vos projets de parcours professionnels !</br></br>After au phenix pour les plus téméraires 🔥",
    "url": ""
  }
]